app/Controllers/Home.php

    public function index()
    {
        $request = \Config\Services::request();
        $taskModel = new TaskModel();

        $data = [];
        $rules = [
            'task-name' => 'required|min_length[3]',
            'task-description' => 'required'
        ];

        if ($request->getMethod() == 'post') {
            if ($this->validate($rules)) {
                $formData = [
                    'name' => $this->request->getVar('task-name'),
                    'description' => $this->request->getVar('task-description')
                ];
                //save task data to the database
                try {
                    $taskModel->insert($formData);
                } catch (\Exception $e) {
                    exit($e->getMessage());
                }
            }
        } else {
            $data['textarea'] = $this->request->getVar('task-description');
            $data['validation'] = $this->validator;
        }

        //retrieve Data from database
        $data['taskData'] = $taskModel->findAll();
---
INSERT INTO `tasks` (`name`, `description`) VALUES ('Task 5', 'CodeIgniter is an Application Development Framework - a toolkit - for people who build web sites using PHP. Its goal is to enable you to dev')
SELECT *
FROM `tasks`

    public function fetchTaskData()
    {
        $taskModel = new TaskModel();
        $id =  $this->request->getGet('taskId');
        $data['taskInfo'] = $taskModel->find($id);
---
SELECT *
FROM `tasks`
WHERE `tasks`.`id` = '15'